app/Controllers/Admin.php

    protected function countTotalPegawai(){
    $db = \Config\Database::connect(); // Menghubungkan ke database
    $builder = $db->table('user');

    // Menghitung jumlah pengguna dengan level selain admin
    $pegawaiCount = $builder->where('id_level !=', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `id_level` != 1

protected function totaljabatan(){

    $db = \Config\Database::connect();
    $builder = $db->table('jabatan');
    $totalJabatan = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `jabatan`

protected function totallevel(){

    $db = \Config\Database::connect();
    $builder = $db->table('level');
    $totallevel = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `level`

    public function vlistuser()
    {
        if (session()->get('logged_in') && session()->get('id_level') === '1') {
            $userModel = new Muser();
            $jbt = new Mjbt();

            $users = $userModel->findAll();
            $data = [
                'title' => 'Data Pegawai laporan Koperasi',
                'users' => []
            ];

            foreach ($users as $user) {
                if ($user['id_level'] === '1') {
                    continue;
                }

                $jabatan = $jbt->find($user['id_jabatan']);
---
SELECT *
FROM `user`
SELECT *
FROM `jabatan`
WHERE `jabatan`.`id` = '1690791633'

    public function vkurja($id_user){
        if (session()->get('logged_in') && session()->get('id_level') === '1') {
            $kinerjaModel = new Mkinerja();
            $userModel = new Muser();

            $user = $userModel->find($id_user);
---
SELECT *
FROM `user`
WHERE `user`.`id` = '1691134890'

    public function editkinerja($id_kinerja){
        if (session()->get('logged_in') && session()->get('id_level') === '1') {
            $kinerjaModel = new Mkinerja();
            $kinerja = $kinerjaModel->find($id_kinerja);
---
SELECT *
FROM `kinerja`
WHERE `kinerja`.`id` = '1692716623'

public function updatestatus($id_kinerja){
    if ($_SERVER['REQUEST_METHOD'] === 'POST' && session()->get('logged_in') && session()->get('id_level') === '1') {
        $kinerjaModel = new Mkinerja();

        $status = $this->request->getPost('new_status');

        if ($status === 'ditolak') {
            $kinerjaData = $kinerjaModel->find($id_kinerja);
            $mbuktiModel = new Mbukti(); // Ganti dengan model Mbukti yang sesuai

            if ($kinerjaData) {
                // Ambil data bukti untuk mendapatkan nama file yang terkait
                $id_bukti = $kinerjaData['id_bukti'];
                $buktiData = $mbuktiModel->find($id_bukti);

                if ($buktiData) {
                    // Hapus file dari server jika ada
                    $namaFile = $buktiData['file'];
                    $pathToFile = ROOTPATH . 'writable/bukti/' . $namaFile;

                    if (file_exists($pathToFile)) {
                        unlink($pathToFile);
                    }

                    // Hapus data bukti dari database
                    $mbuktiModel->delete($id_bukti);
                }
            }

            // Hapus data kinerja dari database
            $hapus = $kinerjaModel->delete($id_kinerja);
---
SELECT *
FROM `kinerja`
WHERE `kinerja`.`id` = '1692716623'
SELECT *
FROM `bukti`
WHERE `bukti`.`id` = '1692716622'
DELETE FROM `bukti`
WHERE `id` IN ('1692716622')
DELETE FROM `kinerja`
WHERE `id` IN ('1692716623')