app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `nip` = '196412191990031004'
 LIMIT 1
---
    public function plogin(){
        $model = new Muser();
        $nip = $this->request->getPost('nip');
        $password = $this->request->getPost('password');

        $user = $model->where('nip', $nip)->first();