app/Controllers/Pegawai.php

SELECT COUNT(*) AS `numrows`
FROM `kinerja`
---
public function kurja()
{
    $request = service('request');
    $Mkinerja = new Mkinerja();
    $id_user = session()->get('id');
    $kolom = ['id','bulan','tahun'];

    // Pengaturan Pencarian
    $cari = $request->getPost('search')['value'];
    $totalRecords = $Mkinerja->countAllResults();

INSERT INTO `bukti` (`id`, `id_user`, `file`) VALUES (1692716622.3256, '1691134890', 'evaluasi internal tribulan 1 2022.docx')
---
    public function savekurja(){
        $kinerja = new Mkinerja();
        $id_user = session()->get('id');
        $tahun = date('ymdhis');
        $bukti = new Mbukti();

        $entries = $this->request->getPost('entries');
        $buktiFile = $this->request->getFile('bukti');

    if ($buktiFile->isValid() && !$buktiFile->hasMoved()) {
        $buktiFile->move(ROOTPATH . 'writable/bukti');
        $buktiFilePath = $buktiFile->getName();
        $buktiData = [
            'id' => microtime(true),
            'id_user' => $id_user,
            'file' => $buktiFilePath,
        ];
        $bukti->insert($buktiData);

INSERT INTO `kinerja` (`id`, `no`, `sasaran`, `indikator`, `status`, `id_bukti`, `ktribulan_realisasi`, `anggaran_realisasi`, `ktahunan_target`, `ktribulan_target`, `anggaran_target`, `bulan`, `tahun`, `id_user`, `ktahunan_realisasi`) VALUES (1692716623.3496, '1', 'Meningkatnya Usaha Mikro Aktif', 'Persentase Usaha Mikro Aktif', 'ditinjau', 1692716622.3256, '2.5', '16104464', '3', '0.25', '1439893960', '1', '230822030342', '1691134890', 2.5)
---
              $data['ktahunan_realisasi'] = $data['ktribulan_realisasi'] * 1;


                $kinerja->insert($data);