app/Models/Mkinerja.php

public function filebukti ($id_user)
{
    return $this->select('kinerja.*, bukti.file') // Pilih kolom yang ingin ditampilkan
        ->join('bukti', 'kinerja.id_bukti = bukti.id') // Join tabel Mbukti
        ->where('kinerja.id_user', $id_user)
        ->findAll();
---
SELECT `kinerja`.*, `bukti`.`file`
FROM `kinerja`
JOIN `bukti` ON `kinerja`.`id_bukti` = `bukti`.`id`
WHERE `kinerja`.`id_user` = '1691134890'