app/Models/Muser.php

SELECT *
FROM `user`
WHERE `id_jabatan` = '1690791633'
---
    public function getUsersByJabatan($jabatan)
    {
        return $this->where('id_jabatan', $jabatan)->findAll();